public class ClosetoTen {
    public static void main(String[] args) {
        // 1) Создать программу, выводящую на экран ближайшее
        // к 10 из двух чисел, записанных в переменные m и n.
        // Например, среди чисел 8.5 и 11.45 ближайшее к десяти 11.45.
        double m;
        double n;
        double resm;
        double resn;
        m = -2;
        n = 112.05;
        // сравнить какая переменная имеет ближайшее к 10 значение
        resn = Math.abs(10 - n);
        resm = Math.abs(10 - m);
        if (resm < resn){
            System.out.println("Ближайшее число: " + m);
            } else {
            System.out.println("Ближайшее чтсло: " + n);
        }
//////////////////////////////////////////////////////////////////////////////////////////////
        // 3) Создать программу, выводящую на экран   наибольшую цифру любого трехзначного
        // натурального числа. Примеры работы программы:
        //В числе 208 наибольшая цифра 8 В числе 774 наибольшая цифра 7 В числе 613 наибольшая цифра 6
        int a;
        int b;
        int c;
        int number;
        number = 208;
        a = number / 100;
        b = number / 10 % 10;
        c = number % 100 % 10;

        if (a >= b) {
            if (a > c) {
                System.out.println(a);
            } else System.out.println(c);
        } else System.out.println(b);
        // хотел но не удалось сделать через else if, программа не заходила в эту строчку почему-то
        ///////////////////////////////////////////////////////////////////////////////////////////////

        //1) Создайте программу, выводящую на экран все четырёхзначные числа
        // последовательности 1000 1003 1006 1009 1012 1015 ….

        for (int f = 1000; f < 9999; f = f + 3 )
            System.out.println(f);
        //////////////////////////////////////////////////////////////////////////////////////////////

        //2) Создайте программу, выводящую на экран все неотрицательные элементы
        // последовательности 90 85 80 75 70 65 60 ….
        int dble = 90;
        do {
          System.out.println(dble);
          dble -= 5;
        } while (dble > 0);
        /////////////////////////////////////////////////////////////////////////////////////////////

        //3) Создайте программу, выводящую на экран первые 20
        // элементов последовательности 2 4 8 16 32 64 128 ….
        int s = 2;
        int t = 1;
        do {
            System.out.println(s);
            s *= 2;
            t ++;
        }while (t <= 20);
        //////////////////////////////////////////////////////////////////////////////////////////

        // 5) Выведите на экран первые 11 членов последовательности Фибоначчи.
        // Первый и второй члены последовательности равны единицам,
        // а каждый следующий — сумме двух предыдущих.

        int fib1 = 1;
        int fib2 = 1;
        int fib3 = 0;
        int count = 1;
        System.out.println(fib1);
        System.out.println(fib3);
        do {
            fib1 = fib2;
            fib2 = fib3;
            fib3 = fib2 + fib1;
            System.out.println(fib3);
            count++;
        } while (count <= 11);


    }
}
